; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-7-16)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p1-3 - location
	p4-0 - location
	p4-1 - location
	p4-3 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s4)
	(at driver3 s2)
	(at driver4 s2)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s4)
	(empty truck5)
	(at truck6 s3)
	(empty truck6)
	(at truck7 s0)
	(empty truck7)
	(at package1 s2)
	(at package2 s1)
	(at package3 s1)
	(at package4 s1)
	(at package5 s2)
	(at package6 s3)
	(at package7 s0)
	(at package8 s2)
	(at package9 s3)
	(at package10 s3)
	(at package11 s4)
	(at package12 s0)
	(at package13 s2)
	(at package14 s0)
	(at package15 s2)
	(at package16 s4)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s4)
	(link s4 s0)
	(link s2 s4)
	(link s4 s2)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s3)
	(at driver3 s2)
	(at truck3 s0)
	(at truck4 s1)
	(at truck6 s3)
	(at package1 s1)
	(at package2 s3)
	(at package3 s1)
	(at package4 s3)
	(at package5 s3)
	(at package6 s2)
	(at package7 s2)
	(at package8 s1)
	(at package10 s0)
	(at package11 s3)
	(at package12 s4)
	(at package13 s0)
	(at package14 s1)
	(at package15 s4)
	(at package16 s2)
	))


)

; plan
1. (board-truck driver4 s2 truck1)
   deleted: (at driver4 s2) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 3 of 21
2. (load-truck s2 package8 truck1)
   deleted: (at package8 s2)
   added: (in package8 truck1)
   goals met: 3 of 21
3. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 3 of 21
4. (load-truck s0 package7 truck1)
   deleted: (at package7 s0)
   added: (in package7 truck1)
   goals met: 3 of 21
5. (load-truck s0 package14 truck1)
   deleted: (at package14 s0)
   added: (in package14 truck1)
   goals met: 3 of 21
6. (load-truck s0 package12 truck1)
   deleted: (at package12 s0)
   added: (in package12 truck1)
   goals met: 3 of 21
7. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 3 of 21
8. (unload-truck s2 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s2)
   goals met: 4 of 21
9. (load-truck s2 package5 truck1)
   deleted: (at package5 s2)
   added: (in package5 truck1)
   goals met: 4 of 21
10. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 4 of 21
11. (load-truck s4 package16 truck2)
   deleted: (at package16 s4)
   added: (in package16 truck2)
   goals met: 4 of 21
12. (board-truck driver2 s4 truck2)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 4 of 21
13. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 4 of 21
14. (unload-truck s1 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s1)
   goals met: 5 of 21
15. (load-truck s1 package4 truck1)
   deleted: (at package4 s1)
   added: (in package4 truck1)
   goals met: 5 of 21
16. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 5 of 21
17. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 5 of 21
18. (load-truck s2 package15 truck1)
   deleted: (at package15 s2)
   added: (in package15 truck1)
   goals met: 5 of 21
19. (drive-truck driver4 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 5 of 21
20. (drive-truck driver4 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 5 of 21
21. (load-truck s3 package6 truck1)
   deleted: (at package6 s3)
   added: (in package6 truck1)
   goals met: 5 of 21
22. (drive-truck driver4 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 5 of 21
23. (unload-truck s4 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s4)
   goals met: 6 of 21
24. (unload-truck s4 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s4)
   goals met: 7 of 21
25. (drive-truck driver4 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 7 of 21
26. (unload-truck s2 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   goals met: 8 of 21
27. (load-truck s2 package13 truck1)
   deleted: (at package13 s2)
   added: (in package13 truck1)
   goals met: 8 of 21
28. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 8 of 21
29. (unload-truck s0 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s0)
   goals met: 9 of 21
30. (load-truck s4 package11 truck2)
   deleted: (at package11 s4)
   added: (in package11 truck2)
   goals met: 9 of 21
31. (drive-truck driver2 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 9 of 21
32. (drive-truck driver4 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 9 of 21
33. (unload-truck s3 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s3)
   goals met: 10 of 21
34. (load-truck s3 package10 truck2)
   deleted: (at package10 s3)
   added: (in package10 truck2)
   goals met: 10 of 21
35. (drive-truck driver2 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 10 of 21
36. (drive-truck driver4 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 10 of 21
37. (unload-truck s3 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s3)
   goals met: 11 of 21
38. (unload-truck s3 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s3)
   goals met: 12 of 21
39. (drive-truck driver4 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 12 of 21
40. (drive-truck driver4 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 12 of 21
41. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 12 of 21
42. (load-truck s1 package2 truck1)
   deleted: (at package2 s1)
   added: (in package2 truck1)
   goals met: 12 of 21
43. (unload-truck s1 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s1)
   goals met: 13 of 21
44. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 13 of 21
45. (drive-truck driver4 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 13 of 21
46. (drive-truck driver4 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 13 of 21
47. (unload-truck s3 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s3)
   goals met: 14 of 21
48. (drive-truck driver2 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 14 of 21
49. (unload-truck s2 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s2)
   goals met: 15 of 21
50. (drive-truck driver2 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 15 of 21
51. (board-truck driver1 s3 truck3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 15 of 21
52. (drive-truck driver1 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 15 of 21
53. (disembark-truck driver1 s4 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s4) (empty truck3)
   goals met: 15 of 21
54. (drive-truck driver2 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 15 of 21
55. (unload-truck s0 package10 truck2)
   deleted: (in package10 truck2)
   added: (at package10 s0)
   goals met: 16 of 21
56. (drive-truck driver2 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 16 of 21
57. (load-truck s2 package1 truck2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   goals met: 16 of 21
58. (drive-truck driver2 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 16 of 21
59. (drive-truck driver2 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 16 of 21
60. (disembark-truck driver2 s1 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 16 of 21
61. (unload-truck s1 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   goals met: 17 of 21
62. (walk driver2 s1 p1-3)
   deleted: (at driver2 s1)
   added: (at driver2 p1-3)
   goals met: 17 of 21
63. (walk driver2 p1-3 s3)
   deleted: (at driver2 p1-3)
   added: (at driver2 s3)
   goals met: 18 of 21
64. (board-truck driver1 s4 truck4)
   deleted: (at driver1 s4) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 18 of 21
65. (drive-truck driver1 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 18 of 21
66. (drive-truck driver4 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 18 of 21
67. (disembark-truck driver4 s4 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s4) (empty truck1)
   goals met: 18 of 21
68. (board-truck driver4 s4 truck3)
   deleted: (at driver4 s4) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 18 of 21
69. (drive-truck driver4 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 19 of 21
70. (drive-truck driver1 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 20 of 21
71. (disembark-truck driver1 s1 truck4)
   deleted: (driving driver1 truck4)
   added: (at driver1 s1) (empty truck4)
   goals met: 21 of 21
